package test;
/**
 * 闯迷宫
描述:	
sun所在学校每年都要举行电脑节，今年电脑节有一个新的趣味比赛项目叫做闯迷宫。
sun的室友在帮电脑节设计迷宫，所以室友就请sun帮忙计算下走出迷宫的最少步数。
知道了最少步数就可以辅助控制比赛难度以及去掉一些没有路径到达终点的map。
比赛规则是：从原点（0,0）开始走到终点（n-1,n-1），只能上下左右4个方向走，只能在给定的矩阵里走。
运行时间限制:	10 Sec
内存限制:	128 MByte
输入:	
输入有多组数据。
﻿
每组数据输入n（0<n<=100），然后输入n*n的0、1矩阵，0代表该格子没有障碍，为1表示有障碍物。
注意：如果输入中的原点和终点为1则这个迷宫是不可达的。
输出:	
对每组输入输出该迷宫的最短步数，若不能到达则输出-1。
样例输入:	
2
0 1
0 0
5
0 0 0 0 0
1 0 1 0 1
0 0 0 0 0
0 1 1 1 0
1 0 1 0 0
样例输出:	
2
8

 */
/** 
 * @author  yong.liu.sh 
 * @date 创建时间：2016年8月12日 下午3:00:40 
 * @return  
 */
public class RushMaze {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
